[
    {
        "id": 1,
        "codigo_cap": "C1",
        "narrativa": "\"Gláucia, está aí? Descobrimos que o Roberto, que testemunhou no caso, na verdade é o assassino. Ele está prestes a fazer mais uma vítima! Precisamos de todas as informações dele agora! Só me lembro do RG dele: 12.345.678-9. Use essa informação na tabela 'Moradores' do banco de dados do condomínio.\"\n\nVocê escuta esse chamado urgente assim que retorna com os cafés que sua supervisora Gláucia pediu. Ao chegar à mesa, percebe que ela não está por perto. Sem saber ao certo o que fazer, você deixa os cafés e pensa em procurar sua chefe, mas a voz no rádio insiste:\n\n\"Está ouvindo?! Precisamos desses dados agora, ou mais uma pessoa pode morrer!\"\n\nO computador de Gláucia está ligado, com o terminal do banco de dados aberto, pronto para um comando. De repente, a responsabilidade está nas suas mãos.",
        "enunciado": "Recupere todos os dados da testemunha chamada Roberto, que possui o RG 12.345.678-9, na tabela 'Moradores'",
        "dica": "\"Ei, você não é a Gláucia! Estamos sem tempo para introduções, só siga minhas instruções\"\n\nPara resolver este nível, será necessário usar a construção básica de uma consulta SQL composta pelas cláusulas SELECT, FROM e WHERE.\n\nA tabela com a resposta se chama \"Moradores\", execute o seguinte comando para visualizar sua estrutura:\n\n```sql\nPRAGMA table_info(Moradores);\n```",
        "personagem_nome": "Emília (telefone)",
        "solucao": "SELECT * FROM Moradores WHERE rg = '12.345.678-9';",
        "feedback_correto": "\"Muito bem! Fique sabendo que sua ajuda salvou uma vida. Irei conversar com sua supervisora sobre este seu ato heróico!\"",
        "feedback_errado": "\"Essas não são as informações que pedi! Não temos tempo para erros, uma vida está em risco!!\"",
        "codigo_base": "C1S1"
    },
    {
        "id": 2,
        "codigo_cap": "C1",
        "narrativa": "A sua ajuda resultou na prisão de mais um assassino investigado pela Unidade de Ciências Comportamentais (UCC) da Polícia Federal (PF).\nAssim que soube do seu feito, Gláucia comentou:\n\"Você tem mais potencial do que eu pensava. Acho que está na hora de lhe dar tarefas mais interessantes do que buscar cafés”. Animada, ela continuou: “Vou ligar para a Emília, a líder da equipe, para ver se ela precisa de nossas habilidades mágicas e tecnológicas\"\nMesmo em um ambiente tão sério, Gláucia mantinha seu jeito descontraído e feliz. No mesmo instante, o telefone tocou. Era Emília.\n\n\"Gláucia, eu já ia te ligar!\". Disse Emília, do outro lado da linha. \"Acabamos de descobrir que Roberto não foi o responsável por todos os assassinatos que aconteceram no condomínio. Há outro assassino em série à solta. Ele deve estar furioso por Roberto ter sido acusado por crimes que não cometeu e, provavelmente, não vai demorar para provar que o verdadeiro culpado ainda não foi pego\"\n\n\"Ótimo! É só me passar as informações. A partir de hoje, estou com reforços, e esse assassino patético não terá chance contra nossas mentes combinadas\"\n\n\"Olá, recruta\". Cumprimentou Emília, com um tom mais sério. \"Fico feliz com a nova adição à equipe. Espero que leve este trabalho muito a sério. Voltando ao caso: testemunhas disseram ter visto um Gol cinza saindo das cenas do crime logo após os assassinatos. Acreditamos que o assassino seja um morador, pois não houve registro de visitantes no condomínio nesses dias. Fomos informados que todos os carros dos residentes estão cadastrados no banco de dados do condomínio e que os registros dizem a casa ao qual pertencem\"\n\"Maravilhoso! Temos tudo o que precisamos, Emília\". Concluiu Gláucia, virando-se para você. \"Recruta, pesquise o código da casa pelo modelo e cor do carro na tabela ‘Veiculos’. Vamos ver o que você encontra\"",
        "dica": "\"Vamos, recruta! A Emília foi bem clara sobre as pistas que temos. A informação está toda na tabela de veículos. Foque no que ela disse e você encontrará o código da casa.\"\n\nPara resolver este desafio, você precisará filtrar os dados da tabela **Veiculos** com base em duas condições simultaneamente: o modelo e a cor do carro. Lembre-se de usar um operador lógico para combinar múltiplas condições na sua cláusula **WHERE**.\n\nA tabela com a resposta se chama **Veiculos**, execute o seguinte comando para visualizar sua estrutura:\n\n```sql\nPRAGMA table_info(Veiculos);\n```",
        "enunciado": "Consulte na tabela 'Veiculos' o código da casa ao qual pertence o carro do modelo 'Gol' e da cor 'Cinza'",
        "personagem_nome": "Gláucia",
        "solucao": "SELECT codigo_casa FROM Veiculos WHERE modelo = 'Gol' AND cor = 'Cinza';",
        "feedback_correto": "\"Correto!! Que sorte, só há um único carro em todo o condomínio com essa descrição. Assim fica fácil!\"",
        "feedback_errado": "\"Eu, como sua supervisora, estou decepcionada! Essa consulta não está correta, deixe eu te ajudar e vamos tentar novamente\"",
        "codigo_base": "C1S1"
    },
    {
        "id": 3,
        "codigo_cap": "C1",
        "narrativa": "\"Só tem uma casa com o carro que procuramos, que sorte! Vou ligar para a equipe agora mesmo!\", diz Gláucia, enquanto digita rapidamente no telefone.\n\n\"Dr. Francisco Buarque falando. Gláucia, é você?\", uma nova voz soa pelo telefone. Apesar da formalidade, o tom é de um jovem.\n\n\"Francisco, você precisa parar de falar de um jeito tão formal! Sempre que te ouço, lembro dos professores que me traumatizaram na escola. Enfim, descobrimos que há apenas um carro no condomínio inteiro que bate com a descrição, e ele pertence à casa '1A'\".\n\n\"Dois assassinos em série no mesmo condomínio e agora um único Gol cinza numa comunidade com milhares de pessoas... A probabilidade de tudo isso acontecer é ínfima. Preciso documentar esses achados em um artigo depois…\"\n\n\"Cara, não é hora de pensar nisso\", outra voz desconhecida corta Francisco. \"Gláucia, gatinha, aqui é o Henrique. Fiquei sabendo que virou babá, hein? Espero que tenha fôlego pra te seguir! E falando nisso, Recruta, que bom ter você na equipe! Vou te dar o resumo da nossa linha de investigação para que possa ajudar. A UCC trabalha com perfis comportamentais; para isso, precisamos de padrões, o que nos leva a casos seriais. O padrão de violência e o modus operandi neste caso indicam um agressor homem. O nome é a peça que falta agora. Por favor, verifique na tabela 'Moradores' quem reside na casa '1A'\"\n\nAssim que Henrique lhe passa a tarefa, Gláucia se vira para você e aponta para o computador. É a sua vez de assumir novamente o controle do terminal.",
        "enunciado": "Recupere o nome do morador na tabela 'Moradores' que possui o gênero 'M' e que more na casa '1A'.",
        "dica": "\"E aí, recruta! Bem-vindo ao jogo. A lógica é a mesma de antes, só que agora com as informações que eu te passei. Mostre pra gente o que você sabe fazer!\"\n\nO seu objetivo é consultar a tabela **Moradores**. Assim como no nível anterior, será necessário filtrar a busca utilizando duas condições na cláusula **WHERE** para encontrar o morador que corresponda tanto à casa quanto ao gênero que investigamos.\n\nA tabela que contém a informação se chama **Moradores**. Use o comando a seguir para ver sua estrutura e os nomes exatos das colunas:\n\n```sql\nPRAGMA table_info(Moradores);\n```",
        "feedback_correto": "\"Bingo! Valeu, Recruta. Agora nós podemos ir prender esse palhaço\"",
        "feedback_errado": "\"Recruta, chega de brincadeiras. Isso não é o que pedi. Vamos lá, sei que você consegue\"",
        "personagem_nome": "Henrique (telefone)",
        "solucao": "SELECT nome FROM Moradores WHERE codigo_casa = '1A' AND genero = 'M';",
        "codigo_base": "C1S1"
    },
    {
        "id": 4,
        "codigo_cap": "C1",
        "narrativa": "Depois de um dia exaustivo, seu corpo cedeu assim que encontrou a cama. O sono profundo é interrompido pelo toque insistente do celular. Um número desconhecido. Ao atender, uma voz familiar, de uma formalidade quase cirúrgica, soa do outro lado:\n\n\"Dr. Francisco Buarque falando. Recruta, sua presença é requisitada no escritório imediatamente. Fomos designados a um novo caso em Goiânia, para onde a equipe se deslocará em breve. O transporte aéreo incluirá provisões para a primeira refeição do dia\".\n\nAntes que você possa formular uma resposta, a chamada é encerrada.\n\nVocê se veste às pressas, joga algumas roupas numa mala e segue para o escritório. Já a bordo do jato com o resto da equipe, a reunião se inicia, liderada por Francisco.\n\n\"Fomos notificados sobre três homicídios ocorridos em Goiânia nos últimos dois meses\", ele começa, com o olhar fixo nos arquivos em sua mão. \"A investigação local está estagnada, mas levanta a hipótese de conexão entre os casos. Uma análise preliminar dos relatórios que recebi indica a presença de um padrão ritualístico nas cenas do crime, embora sua natureza exata ainda demande um estudo aprofundado. A metodologia do agressor sugere experiência, o que me leva a postular a existência de vítimas anteriores, ainda não associadas a esta série. Nosso primeiro passo, portanto, será validar essa hipótese. Recruta, sua diretriz inicial é compilar todos os dados de vítimas em Goiânia a partir do ano de 2023. Preciso dessa base de dados para uma análise manual em busca de correlações\".",
        "enunciado": "Consulte, na tabela 'Vitimas', todos os registros que ocorreram na cidade de 'Goiânia' cujo ano de ocorrência seja maior ou igual a 2023.",
        "dica": "\"Recruta, a precisão é fundamental neste estágio. Concentre-se nos dois parâmetros que delimitei para a sua busca: a localidade geográfica e o marco temporal. A intersecção desses dois conjuntos de dados nos fornecerá o que necessito.\"\n\nPara esta consulta, você deverá filtrar a tabela **Vitimas** com base em duas colunas distintas. Uma delas requer uma correspondência de texto exata para a cidade. A outra exige uma comparação numérica, utilizando um operador para selecionar valores que sejam 'maiores ou iguais' ao ano especificado. Lembre-se de combinar estas duas condições na sua cláusula **WHERE**.\n\nA tabela com os dados necessários se chama **Vitimas**. Examine sua estrutura com o comando a seguir para identificar os nomes corretos das colunas.\n\n```sql\nPRAGMA table_info(Vitimas);\n```",
        "feedback_correto": "\"Maravilhoso, agora irei imprimir todos esses registros e fazer uma análise manual bem detalhada. Acredito que consigo passar por tudo isso até chegarmos em Goiânia\"",
        "feedback_errado": "\"Recruta, temo que os dados que me foram apresentados não estão corretos. Peço, por favor, que tente novamente\"",
        "personagem_nome": "Dr. Francisco Buarque",
        "solucao": "SELECT * FROM Vitimas WHERE cidade = 'Goiânia' AND ano_ocorrencia >= 2023;",
        "codigo_base": "C1S2"
    },
    {
        "id": 5,
        "codigo_cap": "C1",
        "narrativa": "Você observa, fascinado, as mãos de Francisco folheando os registros. As páginas passam em um borrão, numa velocidade que desafia a compreensão, e você duvida que um ser humano normal consiga absorver qualquer informação daquele jeito.\n\nUma mão toca levemente seu ombro, e você se vira para encontrar Emília, a líder da equipe, com um pequeno sorriso no rosto.\n\n\"Ei, recruta\", ela diz em voz baixa para não atrapalhar a concentração geral. \"Espero que a noite de sono improvisada tenha ajudado. Sei que nossa rotina pode ser bem cansativa às vezes, mas lembre-se do porquê fazemos isso.\"\n\nEla faz uma pausa, seu olhar se desviando por um segundo para o restante da equipe trabalhando em silêncio antes de voltar para você.\n\n\"Enfim, preciso de um favor\", continua ela, inclinando a cabeça sutilmente na direção de Francisco. \"O nosso gênio ali está em outro planeta, processando todos os relatórios que trouxemos. Não quero nem pensar em quebrar a concentração dele agora. Se ele já tem essa cara séria normalmente, imagine o humor que fica quando alguém ousa interromper uma linha de raciocínio. Um dia você se acostuma. Ou não\"\n\nSeu sorriso some, dando lugar à expressão focada de uma líder. \"Lembro de ter lido que os três crimes que recebemos tiveram registros de itens roubados. Tenho uma suspeita que preciso confirmar. Poderia consultar para mim quais itens foram levados nos crimes associados ao código de caso '347B9'?\"",
        "enunciado": "Consulte, na tabela ’Crimes’, o item roubado de todos os registros que possuem o código de caso igual a '347B9'",
        "dica": "\"Conto com você, recruta. É uma busca simples, basta filtrar pelo código de caso que te passei. Vamos ver o que você encontra.\"\n\nDesta vez, a sua tarefa é focar em uma única coluna. Você precisará consultar a tabela **Crimes** e usar a cláusula **WHERE** para encontrar todos os registros que correspondam a um código de caso específico. Lembre-se de selecionar apenas a coluna que contém a informação do item roubado.\n\nA tabela que você precisa consultar se chama **Crimes**. Verifique a estrutura dela com o comando abaixo para encontrar os nomes exatos das colunas.\n\n```sql\nPRAGMA table_info(Crimes);\n```",
        "feedback_correto": "\"Muito obrigada, Recruta. Tenho quase certeza de que encontrei um padrão nesses casos\"",
        "feedback_errado": "\"Essas não são as informações que pedi. Estamos quase chegando em Goiânia, faça a consulta novamente antes de chegarmos\"",
        "personagem_nome": "Emília",
        "solucao": "SELECT item_roubado FROM Crimes WHERE codigo_caso = '347B9';",
        "codigo_base": "C1S2"
    },
    {
        "id": 6,
        "codigo_cap": "C1",
        "narrativa": "Ao chegarem em Goiânia, vocês se instalam em uma ampla sala de reuniões na delegacia principal da cidade. O ar tem o cheiro de café fresco e de trabalho acumulado. Enquanto a equipe organiza os quadros brancos e espalha os registros dos casos sobre a mesa, a reunião começa.\n\nFrancisco é o primeiro a falar:\n\n\"Concluí a análise de todos os homicídios registrados nesta cidade desde 2023. Identifiquei uma lista preliminar de vítimas que se alinham ao nosso agressor. Contudo, para confirmar a correlação, necessitamos de um parâmetro de filtragem mais forte. Minha hipótese inicial é que todas as vítimas possuem 40 anos ou mais.\"\n\nEmília, que ouvia atentamente do outro lado da mesa, levanta a mão.\n\n\"Acho que posso ajudar com isso. Encontrei um padrão que você deixou passar.\"\n\nUma visível expressão de aborrecimento cruza o rosto de Francisco ao ouvir a provocação. Emília continua, com um leve sorriso.\n\n\"As nossas três vítimas confirmadas tiveram um pertence pessoal roubado, algo que os familiares notaram de imediato. Nosso assassino é um colecionador. Recruta\", ela se vira para você, e seu tom muda de desafiador para diretivo, \"vamos montar a lista definitiva. Consulte o nome completo das vítimas com 40 anos ou mais da cidade de Goiânia, o item roubado de cada uma e a data do crime. Faça a ordenação em ordem alfabética para ficar mais fácil de lermos os dados. Com essas informações, poderemos finalmente definir o perfil dele.\"",
        "enunciado": "A partir das tabelas 'Vitimas' e 'Crimes', consulte o nome completo da vítima, o item roubado e a data do crime para todas as vítimas da cidade de 'Goiânia' que tenham 40 anos de idade ou mais. Os resultados devem ser ordenados em ordem alfabética pelo nome da vítima.",
        "dica": "\"Vamos lá, recruta, agora a coisa fica interessante. Precisamos juntar as informações das vítimas com as dos crimes. Pense em como conectar os dados das duas tabelas. E não se esqueça de organizar a lista no final para facilitar nossa análise.\"\n\nEsta é a sua consulta mais complexa até agora. Você precisará de informações que estão em duas tabelas separadas: **Vitimas** e **Crimes**. Para combinar dados de múltiplas tabelas, você deve usar a cláusula **JOIN**, especificando qual coluna elas têm em comum para se conectarem.\n\nDepois de juntar as tabelas, aplique os filtros de cidade e idade na cláusula **WHERE**.\n\nPor fim, para organizar o resultado em ordem alfabética como solicitado, utilize a cláusula **ORDER BY** no final da sua consulta.\n\nVocê precisará examinar a estrutura de ambas as tabelas para encontrar a coluna em comum e os nomes exatos das colunas que precisa selecionar e filtrar. Use os seguintes comandos:\n\n```sql\nPRAGMA table_info(Vitimas);\nPRAGMA table_info(Crimes);\n```",
        "feedback_correto": "\"Bom trabalho! Passarei essa lista para Francisco. Acredito que ele terá alguma análise genial para fazer\"",
        "feedback_errado": "\"Essa não me parece ser a lista correta. Tente de novo, Recruta!\"",
        "personagem_nome": "Emília",
        "solucao": "SELECT v.nome_completo, c.item_roubado, c.data_crime FROM Vitimas AS v JOIN Crimes AS c ON v.id = c.id_vitima WHERE v.cidade = 'Goiânia' AND v.idade >= 40 ORDER BY nome_completo ASC;",
        "codigo_base": "C1S2"
    },
    {
        "id": 7,
        "codigo_cap": "C1",
        "narrativa": "A sala de reuniões é um centro de atividade focada. A equipe analisa a lista definitiva, riscando nomes, fazendo anotações nos quadros brancos e discutindo hipóteses em voz baixa. Em meio a essa concentração, Henrique se aproxima da sua mesa com um andar tranquilo.\n\n\"E então, recruta? Encontrando seu lugar no meio do caos?\", ele pergunta com um sorriso discreto. \"Tenho uma análise que pode nos ajudar a clarear as coisas.\"\n\nEle se apoia na beirada da mesa, mantendo o tom de conversa.\n\n\"É o tipo de cálculo que eu poderia pedir para o supercomputador que o Francisco chama de cérebro\", ele diz, gesticulando discretamente para o colega concentrado. \"Mas quero ter certeza de que ele não perca o foco. E também quero ver do que você é capaz\"\n\nHenrique se endireita, seu tom se tornando um pouco mais sério, mas ainda encorajador.\n\n\"A Gláucia consolidou todos os casos confirmados em uma nova tabela chamada 'Vitimas_colecionador'. Sim, foi o apelido que demos para ele. Quero que você consulte essa tabela e me retorne três informações: a média de idade das vítimas, a idade da mais jovem e a da mais velha. Esses dados são essenciais para definirmos o perfil da vitimologia desse maluco\"",
        "enunciado": "A partir da tabela 'Vitimas_colecionador', calcule e retorne a média de idade de todas as vítimas, assim como a idade da vítima mais jovem e a da mais velha.",
        "dica": "\"Beleza, recruta, hora de fazer a matemática. Quero o pacote completo: a média de idade, a idade do caçula e a do vovô do grupo. O SQL tem uns truques pra fazer isso de uma vez só. Mostra pra mim.\"\n\nPara resolver este desafio, você não vai filtrar linhas, mas sim calcular valores a partir de uma coluna inteira. O SQL oferece \"funções de agregação\" para isso.\n\nVocê precisará usar três funções diferentes na sua cláusula **SELECT**: uma para calcular a **média** (AVG), uma para encontrar o valor **mínimo** (MIN) e outra para o valor **máximo** (MAX). Todas elas podem ser usadas na mesma consulta para retornar os três resultados de uma vez.\n\nA nova tabela consolidada se chama **Vitimas_colecionador**. Use o comando abaixo para confirmar o nome da coluna de idade.\n\n```sql\nPRAGMA table_info(Vitimas_colecionador);\n```",
        "feedback_correto": "\"Valeu, Recruta. Esses dados irão nos ajudar bastante. Vamos lá pegar esse louco!\"",
        "feedback_errado": "\"Eu não sou um gênio, mas tenho quase certeza de que esse resultado está errado. Tente de novo, Recruta!\"",
        "personagem_nome": "Henrique",
        "solucao": "SELECT avg(idade) as media, min(idade) as minimo, max(idade) as maximo FROM Vitimas_colecionador;",
        "codigo_base": "C1S2"
    },
    {
        "id": 8,
        "codigo_cap": "C1",
        "narrativa": "Mal Henrique se afasta e Gláucia já está de pé, gesticulando para o quadro branco.\n\n\"Ideia! Brilhante!\", diz ela, mais para si mesma do que para os outros. \"Os itens roubados são antiguidades, e as idades batem com o perfil de colecionadores. Eles não acham isso em lojas, eles usam a internet... Fóruns!\"\n\nSeu olhar encontra o seu, intenso e decidido.\n\n\"Recruta, preciso de um cruzamento de dados, agora. Temos o RG das vítimas na tabela 'Vitimas_colecionador'. Use isso para encontrar o email delas no banco de dados 'Cidadaos'. Com os e-mails, você consegue rastrear a atividade online de cada uma na tabela 'Atividades_online'. Se eu estiver certa, um nome de fórum vai se repetir como um padrão.\"\n\nEla bate levemente na sua mesa para dar ênfase. \"Mãos à obra! Quero o nome desse fórum!\"",
        "enunciado": "A partir das tabelas 'Vitimas_colecionador', 'Cidadaos' e 'Atividades_online', elabore uma consulta que retorne o nome dos fóruns frequentados pelas vítimas. Use DISTINCT para eliminar duplicatas",
        "dica": "\"Vamos, recruta, o caminho é esse! Das vítimas para os cidadãos, dos cidadãos para a internet! É uma corrente de dados, você só precisa conectar os elos. Quero ver a mágica acontecer!\"\n\nEste desafio levará suas habilidades de **JOIN** a um novo patamar. Você precisará conectar três tabelas em sequência: **Vitimas_colecionador** com **Cidadaos**, e depois **Cidadaos** com **Atividades_online**. Para cada **JOIN**, você deve identificar a coluna que serve como ponte entre as tabelas.\n\nAlém disso, como várias vítimas podem ter frequentado o mesmo fórum, o resultado pode ter nomes duplicados. Para limpar a lista e mostrar cada nome de fórum uma única vez, use a palavra-chave **DISTINCT** logo após o **SELECT**.\n\nVocê precisará da estrutura de todas as três tabelas para encontrar as colunas de conexão. Use os comandos:\n\n```sql\nPRAGMA table_info(Vitimas_colecionador);\nPRAGMA table_info(Cidadaos);\nPRAGMA table_info(Atividades_online);\n```",
        "feedback_correto": "\"Você conseguiu! Incrível! Meu palpite, estava certo. tem um único grupo que todas as vítimas estavam. Essa é a zona de caça do nosso assassino\"",
        "feedback_errado": "\"Assim você me desanima, Recruta. Essa não é a resposta que estamos procurando!\"",
        "personagem_nome": "Gláucia",
        "solucao": "SELECT DISTINCT ao.nome_forum FROM Vitimas_colecionador vc JOIN Cidadaos c ON vc.rg = c.rg JOIN Atividades_online ao ON c.email = ao.email;",
        "codigo_base": "C1S2"
    },
    {
        "id": 9,
        "codigo_cap": "C1",
        "narrativa": "Um silêncio chocado toma conta da sala. Todos olham para você, processando a importância da sua descoberta. A peça final. Francisco é o primeiro a quebrar o silêncio. Ele se dirige a você, com o olhar focado e analítico.\n\n\"Recruta. A convergência dos dados está completa. Agora temos os parâmetros necessários para isolar e identificar o responsável por estas atrocidades.\"\n\nEle faz uma pausa, organizando os pensamentos como se lesse um relatório em sua mente.\n\n\"O perfil psicológico é claro: um indivíduo entre 25 e 30 anos, nascido entre 1995 e 2000. A vitimologia e a natureza dos itens roubados indicam um anseio patológico por posse, frustrado por limitações financeiras. O homicídio tornou-se o meio para um fim: adquirir seus objetos de desejo e, secundariamente, manifestar sua frustração acumulada. Sua tarefa final é aplicar este filtro.\"\n\nFrancisco olha diretamente para você, e sua voz é firme, como a de um cirurgião antes do corte final.\n\n\"Acesse a base de dados 'Cidadaos'. Quero o nome completo e o RG de todos os membros do fórum 'Ecos do Passado' cujo ano de nascimento esteja dentro do intervalo que especifiquei. A lógica nos diz que a resposta estará nessa lista.\"",
        "enunciado": "A partir das tabelas 'Cidadaos' e 'Atividades_online', consulte o nome completo e o RG de todos os membros do fórum 'Ecos do Passado' que nasceram entre os anos de 1995 e 2000, inclusive.",
        "dica": "\"A conclusão está ao nosso alcance, recruta. A sua tarefa consiste em aplicar dois filtros lógicos sobre o conjunto de dados. O primeiro filtro isola o universo de suspeitos ao fórum especificado. O segundo restringe este universo ao nosso perfil demográfico. Execute.\"\n\nPara esta consulta final, você precisará novamente conectar as tabelas **Cidadaos** e **Atividades_online** usando um **JOIN**.\n\nNa cláusula **WHERE**, você aplicará duas condições. A primeira é uma correspondência de texto para o nome do fórum. A segunda é a novidade deste nível: para filtrar um intervalo de valores, como um período de anos, você pode usar o operador **BETWEEN**. A estrutura é **coluna BETWEEN valor1 AND valor2**, e ele já inclui os valores inicial e final na busca.\n\nVerifique a estrutura das duas tabelas para confirmar os nomes das colunas de conexão e dos campos que você precisa consultar e filtrar.\n\n```sql\nPRAGMA table_info(Cidadaos);\nPRAGMA table_info(Atividades_online);\n```",
        "feedback_correto": "\"Somente um nome nessa lista, o Colecionador finalmente desmascarado. Ótimo trabalho, Recruta\"",
        "feedback_errado": "\"Não, essa não é a resposta. Tente novamente, Recruta!\"",
        "personagem_nome": "Dr. Francisco Buarque",
        "solucao": "SELECT c.rg, c.nome_completo FROM Cidadaos c JOIN Atividades_online ao ON c.email = ao.email WHERE ao.nome_forum = 'Ecos do Passado' AND c.ano_nascimento BETWEEN 1995 AND 2000;",
        "codigo_base": "C1S2"
    },
    {
        "id": 10,
        "codigo_cap": "C1",
        "narrativa": "A poeira do caso do Colecionador já havia baixado, deixando um rastro de tédio e silêncio no escritório. Você e Gláucia estavam praticamente hipnotizados pelas telas, até que ela rola a cadeira dela para mais perto da sua mesa, com um ar conspiratório.\n\n\"Ei\", ela sussurra, como se estivesse prestes a contar um segredo de estado. \"Estou oficialmente entediada. E quando fico entediada, fico curiosa.\"\n\nEla aponta com o queixo para um monitor que exibe as câmeras da carceragem. \"Viu aquele detento ali? O universo precisa de mais rostos como aquele e menos papelada como esta.\"\n\nUm sorriso se espalha pelo rosto dela.\n\n\"Vamos fazer uma pequena investigação paralela. Consegui ver o ID dele na tela do guarda: 32. Puxa a ficha dele pra mim e cruza com a nossa base de casos, retornando o código do caso, o tipo do caso e a descrição. Quero saber que tipo de problema um cara desses arruma.\"",
        "enunciado": "A partir das tabelas 'Casos' e 'Detento_caso', consulte o código, o tipo e a descrição do caso associado ao detento cujo ID é 32",
        "dica": "\"Vamos lá, recruta, me ajuda a matar essa curiosidade! O segredo está em conectar o ID do nosso galã misterioso com a ficha de casos dele. Pense nisso como uma ponte de dados. Construa a ponte e me mostre o que tem do outro lado!\"\n\nPara resolver este quebra-cabeça, você precisará buscar informações em duas tabelas diferentes. A tabela **Detento_caso** contém o link entre o detento e o código do caso, enquanto a tabela **Casos** tem os detalhes que queremos (código, tipo e descrição).\n\nUse um **JOIN** para conectar as duas tabelas pela coluna que elas têm em comum. Depois de conectá-las, use a cláusula **WHERE** para filtrar os resultados e mostrar apenas os casos do detento com o ID **32**.\n\nVocê vai precisar da estrutura das duas tabelas para descobrir como conectá-las. Use os comandos abaixo:\n\n```sql\nPRAGMA table_info(Casos);\nPRAGMA table_info(Detento_caso);\n```",
        "feedback_correto": "\"Você conseguiu! Ah, ele está envolvido com casos de agressão. Valentões não fazem o meu tipo, não importa o quão bonitos sejam\"",
        "feedback_errado": "\"Recruta, isso é trabalho sério. Tenta uma nova consulta, estou muito curiosa\"",
        "personagem_nome": "Gláucia",
        "solucao": "SELECT c.codigo, c.descricao, c.tipo FROM Casos C JOIN Detento_caso dc ON c.codigo = dc.codigo_caso WHERE dc.id_detento = 32;",
        "codigo_base": "C1S3"
    },
    {
        "id": 11,
        "codigo_cap": "C1",
        "narrativa": "A tela exibe a longa lista de infrações, e você e Gláucia estão tão absortas na leitura que não percebem a figura que se aproxima em silêncio por trás de suas cadeiras.\n\n\"A correlação é estatisticamente significativa.\"\n\nA voz de Francisco, desprovida de qualquer emoção, soa diretamente atrás de vocês. O susto é inevitável; você e Gláucia se sobressaltam, virando-se bruscamente. Ele está ali, parado, o olhar fixo no monitor de vocês, ignorando completamente a reação de vocês.\n\n\"O resultado está dentro dos parâmetros esperados\", ele continua, como se estivesse ditando um relatório. \"A maioria dos casos envolve agressão física. Proponho validar essa hipótese com dados percentuais. Para isso, precisamos do universo total de eventos como base de cálculo. Recruta\", ele finalmente desvia o olhar da tela para você, \"sua tarefa: consulte e retorne para mim a quantidade absoluta de todos os casos registrados no ano de 2025.\"",
        "enunciado": "Consulte na tabela 'Casos' e retorne a quantidade total de casos registrados durante o ano de 2025",
        "dica": "\"Recruta, para estabelecermos uma base de cálculo fidedigna, é imperativo quantificar o universo total de eventos. Sua diretriz é aplicar um filtro temporal para o ano de 2025 e, em seguida, computar o número absoluto de registros resultantes. Proceda.\"\n\nSua tarefa é contar o número total de linhas na tabela **Casos** que atendem a um critério específico. Primeiro, utilize a cláusula **WHERE** para filtrar os casos que ocorreram no ano de 2025.\n\nEm seguida, para contar quantas linhas foram retornadas por esse filtro, use a função de agregação **COUNT(*)** na sua cláusula **SELECT**.\n\nA tabela que contém os dados necessários se chama **Casos**. Use o comando a seguir para visualizar sua estrutura.\n\n```sql\nPRAGMA table_info(Casos);\n```",
        "feedback_correto": "\"Esse é o resultado o qual eu estava esperando. Muito bem, vamos para a próxima etapa da nossa investigação extraoficial\"",
        "feedback_errado": "\"Não sei o número exato, mas tenho certeza de que não é esse. Faça a consulta novamente, Recruta\"",
        "personagem_nome": "Dr. Francisco Buarque",
        "solucao": "SELECT count(*) as quantidade_casos FROM Casos WHERE ano = 2025;",
        "codigo_base": "C1S3"
    },
    {
        "id": 12,
        "codigo_cap": "C1",
        "narrativa": "Francisco olha novamente para você, o cérebro dele já processando o próximo passo da análise.\n\n\"Para calcularmos a proporção exata, precisamos agora segmentar o universo total de dados\", ele afirma, como se estivesse pensando em voz alta. \"Recruta, sua nova diretriz: execute uma consulta na tabela de casos, agrupando por tipo. A consulta deve retornar cada tipo e sua respectiva contagem de ocorrências, limitada ao ano de 2025.\"\n\nEle faz uma pequena pausa\n\n\"Ordene o resultado de forma decrescente. Isso irá otimizar a visualização. A minha hipótese, com alta probabilidade de confirmação, é que a categoria ‘agressão física’ aparecerá no topo da lista.\"",
        "enunciado": "A partir da tabela 'Casos', consulte a quantidade de ocorrências para cada tipo de caso registrado no ano de 2025. O resultado deve exibir o tipo e sua respectiva contagem, ordenado da maior para a menor frequência.",
        "dica": "\"A análise prossegue, recruta. O próximo passo é a categorização. Sua incumbência é segmentar os dados do universo de 2025 por 'tipo', computar a frequência de cada categoria e, subsequentemente, ordenar os agrupamentos em ordem decrescente de magnitude para validação da hipótese. A clareza dos dados depende da execução correta desta sequência.\"\n\nEste desafio introduz uma cláusula poderosa: **GROUP BY**. Comece filtrando os dados para o ano de 2025 com a cláusula **WHERE**, como você já fez antes.\n\nEm seguida, para contar as ocorrências de cada tipo separadamente, use **COUNT(*)** no **SELECT** e adicione a cláusula **GROUP BY tipo**. Isso fará com que a contagem seja aplicada a cada grupo de tipos de caso individualmente.\n\nPor fim, use a cláusula **ORDER BY** para organizar os resultados da contagem em ordem decrescente (do maior para o menor).\n\nA consulta será executada na tabela **Casos**. Use o comando a seguir para revisar sua estrutura se necessário.\n\n```sql\nPRAGMA table_info(Casos);\n```",
        "feedback_correto": "\"Hipótese validada, viram como eu estava correto? Os casos de agressão física compõe 70% de todos os casos deste ano\"",
        "feedback_errado": "\"Recruta, eu tenho certeza de que esses números não estão corretos. O problema deve estar na sua consulta. Refaça-a imediatamente\"",
        "personagem_nome": "Dr. Francisco Buarque",
        "solucao": "SELECT tipo, count(*) as total FROM Casos WHERE ano = 2025 GROUP BY tipo ORDER BY total DESC;",
        "codigo_base": "C1S3"
    },
    {
        "id": 13,
        "codigo_cap": "C1",
        "narrativa": "\"Então é assim que você se diverte, Francisco? Com análises percentuais?\", Henrique diz ao se aproximar, com um sorriso divertido que logo se desfaz, dando lugar a uma expressão séria. \"Enfim, a brincadeira acabou. Chegou um caso urgente para nós.\"\n\nEle se apoia na mesa central, e o tom de sua voz comanda a atenção de todos na sala.\n\n\"Três ex-detentos tiveram suas casas incineradas nas últimas 24 horas. Todos foram encontrados carbonizados e amarrados em cadeiras. Emília já está a caminho e me pediu para adiantar uma hipótese: a de que as vítimas possam ter uma conexão através de um caso antigo em comum.\"\n\nHenrique então se vira para você.\n\n\"Recruta, vamos usar essa mesma tabela de casos com a qual você estava se divertindo agora. Preciso que você procure por casos que envolvam múltiplos réus. Sua consulta deve me retornar o código do caso e, para cada um, a contagem de detentos relacionados. Mas, para refinar a busca, aplique um filtro e me traga apenas os casos com mais de três detentos envolvidos. Vamos ver se encontramos algum ponto de ligação.\"",
        "enunciado": "A partir das tabelas 'Casos' e 'Detento_caso', retorne o código dos casos que possuem mais de três detentos envolvidos, juntamente com a contagem exata de quantos detentos estão associados a cada um desses casos",
        "dica": "\"Beleza, recruta, a coisa ficou séria. A gente precisa achar os casos 'populosos'. A lógica é agrupar os detentos por caso, contar quantos tem em cada 'bonde', e depois me mostrar só os grupos grandes, com mais de três caras. Peneira essa lista pra mim.\"\n\nEste desafio combina o que você já sabe e adiciona uma nova ferramenta: a cláusula **HAVING**.\n\nComece juntando as tabelas **Detento_caso** e **Casos** com um **JOIN**. Em seguida, use **GROUP BY** no código do caso para poder contar (**COUNT**) quantos detentos há em cada um.\n\nA novidade é aqui: para filtrar os resultados *depois* do agrupamento (por exemplo, \"grupos com contagem maior que 3\"), você não pode usar **WHERE**. Em vez disso, use a cláusula **HAVING**. Ela funciona como um **WHERE**, mas para os resultados das funções de agregação.\n\nVocê precisará das estruturas das duas tabelas para fazer a junção corretamente.\n\n```sql\nPRAGMA table_info(Casos);\nPRAGMA table_info(Detento_caso);\n```",
        "feedback_correto": "\"Bom trabalho, Recruta. Emília já chegou, vamos passar essa lista para ela e ver o que ela acha\"",
        "feedback_errado": "\"Recruta, precisamos focar agora! Essa não é a resposta, tente de novo\"",
        "personagem_nome": "Henrique",
        "solucao": "SELECT c.codigo, count(dc.id_detento) AS total_presos FROM Detento_caso dc JOIN Casos c ON dc.codigo_caso = c.codigo GROUP BY c.codigo HAVING count(dc.id_detento) > 3;",
        "codigo_base": "C1S3"
    },
    {
        "id": 14,
        "codigo_cap": "C1",
        "narrativa": "Enquanto a equipe prepara a sala de reuniões, a tensão é palpável. Quadros são limpos, e os dados do novo caso são organizados com uma eficiência silenciosa. Emília entra na sala, e seu rosto sério imediatamente atrai o olhar de todos.\n\n\"É um dos casos da lista que o recruta encontrou\", ela diz, a voz firme, mas carregada de um peso sombrio. \"O código '589P'. Ele conecta todos os detentos mortos. Eu trabalhei nesse caso quando comecei minha carreira.\"\n\nNesse momento, seu telefone toca. Emília atende, e enquanto ouve, seu rosto perde a cor, a expressão transformando-se de séria para horrorizada. Ela desliga a chamada, a mão tremendo levemente.\n\n\"Acabaram de encontrar o corpo de um antigo colega meu. Um policial que trabalhou comigo no caso ‘589P’. Ele foi morto da mesma forma.\"\n\nEla respira fundo, a líder dentro dela assumindo o controle do choque.\n\n\"Ele foi um dos policiais que efetuou a prisão de um dos ex-detentos. Isso não é coincidência. Os outros policiais daquele caso... eles são os próximos alvos.\"\n\nO olhar de Emília se crava no seu, urgente e afiado.\n\n\"Recruta, preciso de uma análise de risco. Foque no caso ‘589P’. Puxe a lista de todos os detentos daquela operação e, para cada um, identifique o policial responsável pela prisão. Depois, agrupe por policial e me dê a contagem de quantos detentos cada um deles prendeu. Ordene do maior para o menor. O nome no topo da lista é quem corre mais perigo. Vá!\"",
        "enunciado": "A partir das tabelas 'Policiais', 'Detentos' e 'Detento_caso', retorne o nome de cada policial e a contagem total de detentos que ele prendeu no caso de código '589P'. A lista final deve ser ordenada da maior para a menor quantidade de prisões",
        "dica": "\"Sem tempo a perder, recruta. A vida deles depende da nossa velocidade. O caminho dos dados é claro: comece pelo caso '589P', encontre os detentos ligados a ele e, a partir deles, os policiais responsáveis. Agrupe, conte e ordene. Quero a lista de alvos, agora!\"\n\nSua consulta será uma corrente complexa que conecta três tabelas. Comece juntando **Detento_caso** com **Detentos** e, em seguida, conecte esse resultado com a tabela **Policiais**.\n\nÉ crucial que você use a cláusula **WHERE** para isolar a análise apenas ao caso **'589P'** desde o início.\n\nUma vez que as tabelas estejam conectadas e filtradas, aplique a cláusula **GROUP BY** no nome do policial. Isso permitirá que a função **COUNT()** calcule o total de detentos para cada oficial individualmente.\n\nPara finalizar, use **ORDER BY** no resultado dessa contagem para organizar a lista do maior para o menor, identificando o policial em maior risco.\n\nVocê precisará da estrutura de todas as três tabelas para encontrar as colunas corretas para o **JOIN**.\n\n```sql\nPRAGMA table_info(Detento_caso);\nPRAGMA table_info(Detentos);\nPRAGMA table_info(Policiais);\n```",
        "feedback_correto": "\"Obrigada, Recruta! Agora iremos nos dividir para avisar a esses policiais o risco que estão correndo\"",
        "feedback_errado": "\"Recruta, agora definitivamente não é hora para erros. Tente novamente!\"",
        "personagem_nome": "Emília",
        "solucao": "SELECT po.nome, COUNT(d.id) AS total_detentos FROM Detento_caso dc JOIN Detentos d ON dc.id_detento = d.id JOIN Policiais po ON d.policial_responsavel = po.id WHERE dc.codigo_caso = '589P' GROUP BY po.nome ORDER BY total_detentos DESC;",
        "codigo_base": "C1S3"
    },
    {
        "id": 15,
        "codigo_cap": "C1",
        "narrativa": "A divisão foi estratégica: Emília foi para a casa do primeiro policial da lista, o alvo mais provável, enquanto Henrique e Francisco seguiram para a residência do segundo. No escritório, restaram apenas você e Gláucia. Cada minuto de espera parecia uma hora. Finalmente, o telefone de Gláucia toca, e ela atende no primeiro toque, colocando no viva-voz. É a voz de Emília, ofegante e tensa, com o som de fogo crepitando ao fundo.\n\n\"Gláucia! A casa… está tomada pelas chamas! Chame os bombeiros, agora! Vou tentar entrar, o policial pode estar…\", a voz dela é subitamente cortada por um baque surdo, um grunhido de dor, e a chamada cai.\n\n\"Meu Deus, atacaram ela!\", Gláucia grita, pulando da cadeira e pegando suas chaves. \"Recruta, ligue para o Henrique e o Francisco, avise o que aconteceu! Estou indo para lá, sou a mais próxima!\"\n\nVocê liga imediatamente, e ao fundo da chamada com Henrique, ouve o som de pneus cantando. Eles já estão a caminho, mas a voz de Francisco corta a conversa, urgente e estranhamente focada.\n\n\"Recruta, escute\", ele diz, a voz tensa sobre o som do motor acelerando. \"Os bombeiros nos enviaram os relatórios periciais de todos os incêndios. Preciso de dados enquanto estamos no trânsito. Acesse a tabela 'Relatorio_incendios'\"\n\nEle faz uma pausa, claramente processando em alta velocidade.\n\n\"Preciso de um resumo dos combustíveis. Some a quantidade total para cada tipo de combustível usado em todos os incêndios. Retorne a lista ordenada, do mais usado para o menos. Quero ver o padrão. Rápido!\"",
        "enunciado": "A partir da tabela 'Relatorio_incendios', some a quantidade total de cada tipo de combustível utilizado nos incêndios. A lista final deve exibir o tipo de combustível e sua respectiva soma, ordenada da maior para a menor quantidade.",
        "dica": "\"Recruta, a situação é crítica. Foco nos dados. A diretriz é clara: agrupe os registros por tipo de combustível, some as quantidades de cada agrupamento e ordene o resultado de forma decrescente pela soma total. Precisamos do padrão de consumo agora.\"\n\nEsta consulta utiliza uma nova função de agregação: **SUM()**.\n\nComece usando a cláusula **GROUP BY** na coluna **combustivel** para criar grupos para cada tipo de combustível.\n\nEm seguida, no seu **SELECT**, use a função **SUM(quantidade)**. Ela irá somar todos os valores da coluna **quantidade** para cada um dos grupos que você criou.\n\nFinalmente, use **ORDER BY** no resultado da soma para ordenar a lista do maior para o menor total.\n\nA consulta será executada na tabela **Relatorio_incendios**. Use o comando abaixo para ver os nomes exatos das colunas.\n\n```sql\nPRAGMA table_info(Relatorio_incendios);\n```",
        "feedback_correto": "\"Foi usado uma quantidade muito grande de querosene. Essa será a pista que nos levará ao culpado!\"",
        "feedback_errado": "\"Esses números estão errados! Desculpe-me pela falta de paciência, mas não podemos errar nesse momento\"",
        "personagem_nome": "Francisco (telefone)",
        "solucao": "SELECT combustivel, sum(quantidade) as quantidadeTotal FROM Relatorio_incendios GROUP BY combustivel ORDER BY quantidadeTotal DESC;",
        "codigo_base": "C1S3"
    },
    {
        "id": 16,
        "codigo_cap": "C1",
        "narrativa": "Os dias que se seguiram foram um borrão de dor e formalidades sombrias. Gláucia mal conseguia fechar os olhos sem reviver a cena: chegar ao local e encontrar Emília caída, a vida se esvaindo dela nos momentos finais, impotente enquanto o socorro chegava tarde demais. Henrique e Francisco chegaram depois, encontrando apenas as cinzas da casa e a notícia de que o IML já havia levado o corpo. Eles não a viram.\n\nDepois do funeral, um evento rápido e doloroso, a equipe se reuniu na sala de reuniões. O lugar, antes um centro de energia e colaboração, agora estava mergulhado em um silêncio pesado. Gláucia encarava um quadro em branco, os olhos vermelhos e perdidos. Henrique, de pé perto da janela, olhava para a cidade com uma expressão dura, a mandíbula travada.\n\nFrancisco é o primeiro a quebrar o silêncio, sem tirar os olhos do seu monitor. Sua voz é mais formal e desprovida de emoção do que nunca, um mecanismo de defesa contra o caos.\n\n\"O luto é uma variável que não nos levará a uma solução\", ele diz, de forma categórica. \"A análise dos dados, sim. Retornei ao relatório dos incêndios.\"\n\nHenrique se vira lentamente, e Gláucia levanta o olhar.\n\n\"O combustível predominante, com uma margem estatística enorme, foi o querosene\", continua Francisco. \"Um volume tão grande não seria adquirido em lojas físicas sem chamar atenção. A hipótese mais lógica é uma compra online, buscando anonimato. É por aí que vamos encontrá-lo.\"\n\nEle finalmente olha para você, Recruta. O olhar dele não é de tristeza, mas de uma intensidade caçadora.\n\n\"Sua tarefa é a seguinte: acesse os registros nacionais de compras online. Quero que você cruze os dados de Pessoas com suas Compras para rastrear todas as aquisições de ‘Querosene’. Mas não quero todos os compradores.\"\n\nEle faz uma pausa, a lógica se afiando como uma faca.\n\n\"O cidadão comum compra uma quantidade pequena para uso doméstico. O assassino da Emília precisou de um volume industrial. Portanto, agrupe as compras por pessoa e some a quantidade total de querosene que cada uma comprou. Ignore o ruído. Retorne para mim apenas os nomes dos indivíduos cuja soma total de querosene adquirida seja superior a 500 litros. É um volume indefensável para uso normal.\"\n\nEle se inclina ligeiramente para a frente, a voz baixando para uma certeza fria.\n\n\"A resposta que procuramos estará nessa lista.\"",
        "enunciado": "A partir das tabelas 'Pessoas', 'Compras', 'ItensCompra' e 'Produtos', some a quantidade total do produto 'Querosene' comprada por cada pessoa. A consulta deve retornar o nome dos indivíduos cuja quantidade total adquirida seja superior a 500",
        "dica": "\"Recruta, a emoção é ruído. A lógica é o sinal. A diretriz é final: interconecte as quatro tabelas de registros comerciais para mapear cada produto a seu comprador. Isole os dados referentes a 'Querosene'. Em seguida, agrupe por indivíduo, some suas aquisições, e aplique o filtro de 500 litros para eliminar os irrelevantes. O nome do responsável estará no resultado. Não falhe.\"\n\nEsta é a consulta definitiva, combinando tudo o que você aprendeu. A lógica segue uma sequência precisa.\n\nPrimeiro, construa a corrente de **JOIN**s para conectar as quatro tabelas: **Pessoas**, **Compras**, **ItensCompra**, **Produtos**.\n\nUse a cláusula **WHERE** para filtrar suas junções e considerar apenas as compras do produto cujo **nome_produto** seja 'Querosene'.\n\nDepois, use **GROUP BY** no nome da pessoa para agrupar todas as compras de querosene por indivíduo. Isso permitirá que a função **SUM(quantidade)** calcule o total para cada pessoa.\n\nFinalmente, aplique a cláusula **HAVING** para filtrar esses grupos, mostrando apenas aqueles cuja soma total seja maior que 500.\n\nVocê precisará da estrutura de todas as quatro tabelas para executar as junções corretamente.\n\n```sql\nPRAGMA table_info(Pessoas);\nPRAGMA table_info(Compras);\nPRAGMA table_info(ItensCompra);\nPRAGMA table_info(Produtos);\n```",
        "feedback_correto": "\"Adriano Belo… Esse é um anagrama para Ronaldo Biel! Um dos detentos envolvidos no caso '589P'! Iremos nos vingar por você, Emília!\"",
        "feedback_errado": "\"Esse não é o resultado correto. Faça a consulta novamente, Recruta\"",
        "personagem_nome": "Dr. Francisco Buarque",
        "solucao": "SELECT pe.nome FROM Pessoas pe JOIN Compras co ON pe.id_pessoa = co.id_pessoa JOIN ItensCompra ic ON co.id_compra = ic.id_compra JOIN Produtos pr ON ic.id_produto = pr.id_produto WHERE pr.nome_produto = 'Querosene' GROUP BY pe.nome HAVING SUM(ic.quantidade) > 500;",
        "codigo_base": "C1S3"
    },
    {
        "id": 17,
        "codigo_cap": "C2",
        "narrativa": "A pista sobre Ronaldo Biel se provou um beco sem saída, e o caso do assassino de Emília esfriou, tornando-se um fantasma que assombrava a Unidade. O tempo passou. Henrique assumiu a liderança, e a equipe, embora marcada pelo luto, mergulhou em outros casos com uma determinação sombria.\n\nEm uma tarde particularmente calma, essa determinação deu lugar a uma inquietação palpável. Henrique entrou no escritório com uma energia agitada, seus passos ecoando no silêncio. Sem um caso urgente para focar e com a ausência de novas pistas sobre Biel, a inatividade era sua inimiga. Ele passou os olhos pela sala, buscando um propósito, até que seu olhar encontrou o seu. Ele caminhou em sua direção, a mente já trabalhando.\n\n“Recruta, preciso de um panorama da equipe”, ele disse, a voz controlada, mas revelando a urgência que sentia. “Quero um relatório com o nome de cada policial da unidade e o código do caso ao qual está designado no momento.”\n\nEle fez uma pausa, enfatizando o próximo ponto.\n\n“É crucial que essa lista inclua todos, até mesmo quem está sem um caso ativo agora. Preciso ter uma visão clara de quem está sobrecarregado e quem está disponível. Tenho algumas tarefas que precisam ser delegadas.”",
        "enunciado": "A partir das tabelas 'Policiais' e 'Casos', crie um relatório que liste o nome de cada policial e o código do caso ao qual ele está atualmente designado. A lista deve obrigatoriamente incluir todos os policiais, mesmo aqueles que não estão trabalhando em um caso no momento.",
        "dica": "\"Recruta, preciso de um mapa da nossa força de trabalho. O ponto principal é que ninguém pode ficar de fora da lista, entendeu? Quero ver todos os policiais, com ou sem caso na mão.\"\n\nO desafio aqui é garantir que todos os policiais apareçam no resultado, mesmo que não tenham um caso. Um **JOIN** normal (ou **INNER JOIN**) só mostra os policiais que têm um caso correspondente.\n\nPara resolver isso, você precisará usar um **LEFT JOIN**. Um **LEFT JOIN** retorna todos os registros da tabela da esquerda (a primeira que você menciona) e os registros correspondentes da tabela da direita. Se não houver correspondência, o resultado é **NULL** nas colunas da tabela da direita, mas o policial ainda aparecerá na lista.\n\nLembre-se: a tabela **Policiais** deve vir antes do **LEFT JOIN**.\n\nVocê precisará da estrutura das duas tabelas para fazer a junção.\n\n```sql\nPRAGMA table_info(Policiais);\nPRAGMA table_info(Casos);\n```",
        "solucao": "SELECT P.nome, C.codigo FROM Policiais P LEFT JOIN Casos C ON P.nome = C.nome_policial_responsavel;",
        "feedback_correto": "“Obrigado, Recruta. Agora preciso me reunir com esses policiais livres”",
        "feedback_errado": "“Essa lista está errada, Recruta. Preciso dela urgentemente, tente de novo!”",
        "personagem_nome": "Henrique",
        "codigo_base": "C2S1"
    }
]